#ifndef __SENSOR_H
#define __SENSOR_H


#define VOLTAGE_MV_25_DEGREE   1420   //mV in 25°C
#define VOLTAGE_UV_SLOPE       4350   //uV /°C
#define VOLTAGE_MV_REFERENCE   3300   //3300mV参考电压

/********************************************************************************
  函数: GetCpuCoreTemperature
  描述: 得到CPU内核温度, 单位为0.1(°C)
********************************************************************************/
int GetCpuCoreTemperature(void);

/********************************************************************************
  函数: ADC_Configruation
  描述: 测量内核温度AD转化值
********************************************************************************/
INT32U ADC_GetTemperValue(void);


/********************************************************************************
  函数: ADC_GetPowerDownValue
  描述: 测量5V供电电源AD转化值
********************************************************************************/
INT32U ADC_GetPowerDownValue(void);

/********************************************************************************
  函数: ADC_Configruation
  描述: 得到AD转化值
********************************************************************************/
INT32U ADC_GetConvertValue(void);
#endif
